
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>事件处理 · learn-android</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Zander Zhao">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/ZanderZhao/cdn/css/gitalk.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc/page-toc.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1014.html" />
    
    
    <link rel="prev" href="1011.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    本书简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1001.html">
            
                <a href="1001.html">
            
                    
                    简介
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1004.html">
            
                <a href="1004.html">
            
                    
                    配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="1002.html">
            
                <a href="1002.html">
            
                    
                    应用结构
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1005.html">
            
                <a href="1005.html">
            
                    
                    界面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="1006.html">
            
                <a href="1006.html">
            
                    
                    (基本)组件
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="1007.html">
            
                <a href="1007.html">
            
                    
                    Activity和Fragment
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="1008.html">
            
                <a href="1008.html">
            
                    
                    Service
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="1009.html">
            
                <a href="1009.html">
            
                    
                    BroadcastReceiver
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="1010.html">
            
                <a href="1010.html">
            
                    
                    ContentProvider
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="1011.html">
            
                <a href="1011.html">
            
                    
                    *Intent和IntentFilter
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="1012.html">
            
                <a href="1012.html">
            
                    
                    事件处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="1014.html">
            
                <a href="1014.html">
            
                    
                    资源处理
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="1015.html">
            
                <a href="1015.html">
            
                    
                    应用资源
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="1013.html">
            
                <a href="1013.html">
            
                    
                    图形图像
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.3" data-path="1016.html">
            
                <a href="1016.html">
            
                    
                    文件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.4" data-path="1017.html">
            
                <a href="1017.html">
            
                    
                    数据库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.5" data-path="1020.html">
            
                <a href="1020.html">
            
                    
                    其他
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="1018.html">
            
                <a href="1018.html">
            
                    
                    网络应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="1019.html">
            
                <a href="1019.html">
            
                    
                    多媒体应用
            
                </a>
            

            
        </li>
    

    
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >事件处理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E8B;&#x4EF6;&#x5904;&#x7406;">&#x4E8B;&#x4EF6;&#x5904;&#x7406;</h1>
<p>Android&#x4E8B;&#x4EF6;&#x5904;&#x7406;   </p>
<ul>
<li>&#x57FA;&#x4E8E;&#x76D1;&#x542C;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;</li>
<li>&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;</li>
<li>&#x54CD;&#x5E94;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x7684;&#x4E8B;&#x4EF6;</li>
<li>Handler&#x6D88;&#x606F;&#x4F20;&#x9012;&#x673A;&#x5236;</li>
</ul>
<h2 id="&#x57FA;&#x4E8E;&#x76D1;&#x542C;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;">&#x57FA;&#x4E8E;&#x76D1;&#x542C;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;</h2>
<h3 id="&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x7684;&#x5904;&#x7406;&#x6A21;&#x578B;">&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x7684;&#x5904;&#x7406;&#x6A21;&#x578B;</h3>
<ul>
<li>&#x5728;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x7684;&#x5904;&#x7406;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4E3B;&#x8981;&#x6D89;&#x53CA;&#x4E09;&#x7C7B;&#x5BF9;&#x8C61;&#xFF1A;<ul>
<li>Event Source&#xFF08;&#x4E8B;&#x4EF6;&#x6E90;&#xFF09;&#xFF1A;&#x4E00;&#x822C;&#x6307;&#x5404;&#x4E2A;&#x7EC4;&#x4EF6;&#x3002;</li>
<li>Event&#xFF08;&#x4E8B;&#x4EF6;&#xFF09;&#xFF1A;&#x4E00;&#x822C;&#x662F;&#x6307;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#xFF0C;&#x8BE5;&#x4E8B;&#x4EF6;&#x5C01;&#x88C5;&#x4E86;&#x754C;&#x9762;&#x7EC4;&#x4EF6;&#x4E0A;&#x53D1;&#x751F;&#x7684;&#x5404;&#x79CD;&#x7279;&#x5B9A;&#x4E8B;&#x4EF6;&#x3002;</li>
<li>Event Listener&#xFF08;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#xFF09;&#xFF1A;&#x8D1F;&#x8D23;&#x76D1;&#x542C;&#x4E8B;&#x4EF6;&#x6E90;&#x6240;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x5E76;&#x5BF9;&#x8BE5;&#x4E8B;&#x4EF6;&#x505A;&#x51FA;&#x54CD;&#x5E94;&#x3002;</li>
</ul>
</li>
<li>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4E8B;&#x4EF6;&#x54CD;&#x5E94;&#x7684;&#x52A8;&#x4F5C;&#x5C31;&#x662F;&#x4E00;&#x7EC4;&#x7A0B;&#x5E8F;&#x8BED;&#x53E5;&#xFF0C;&#x901A;&#x5E38;&#x4EE5;&#x65B9;&#x6CD5;&#x7684;&#x5F62;&#x5F0F;&#x7EC4;&#x7EC7;&#x8D77;&#x6765;&#x3002;Android&#x5229;&#x7528;&#x7684;&#x662F;Java&#x8BED;&#x8A00;&#x5F00;&#x53D1;&#xFF0C;&#x5176;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x672C;&#x8D28;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#xFF0C;&#x6240;&#x4EE5;&#x65B9;&#x6CD5;&#x5FC5;&#x987B;&#x4F9D;&#x9644;&#x4E8E;&#x7C7B;&#x4E2D;&#x624D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x3002;&#x800C;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x5B83;&#x6240;&#x5305;&#x542B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;(Event Handler)&#x3002;</li>
<li>&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x7684;&#x5904;&#x7406;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x63CF;&#x8FF0;&#xFF1A;&#x5F53;&#x7528;&#x6237;&#x5728;&#x7A0B;&#x5E8F;&#x754C;&#x9762;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x4F1A;&#x6FC0;&#x53D1;&#x4E00;&#x4E2A;&#x76F8;&#x5E94;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x8BE5;&#x4E8B;&#x4EF6;&#x5C31;&#x4F1A;&#x89E6;&#x72AF;&#x4E8B;&#x4EF6;&#x6E90;&#x4E0A;&#x6CE8;&#x518C;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#xFF0C;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x518D;&#x8C03;&#x7528;&#x5BF9;&#x5E94;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#x505A;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x53CD;&#x5E94;&#x3002;</li>
<li>Android&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x673A;&#x5236;&#x91C7;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x59D4;&#x6D3E;&#x5F0F;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF1A;&#x666E;&#x901A;&#x7EC4;&#x4EF6;&#xFF08;&#x4E8B;&#x4EF6;&#x6E90;&#xFF09;&#x5C06;&#x6574;&#x4E2A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x59D4;&#x6D3E;&#x7ED9;&#x7279;&#x5B9A;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#xFF09;&#xFF0C;&#x5F53;&#x8BE5;&#x7EC4;&#x4EF6;&#x53D1;&#x751F;&#x6307;&#x5B9A;&#x7684;&#x4E8B;&#x4EF6;&#x65F6;&#xFF0C;&#x5C31;&#x901A;&#x77E5;&#x6240;&#x59D4;&#x6258;&#x7684;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#xFF0C;&#x7531;&#x8BE5;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x5904;&#x7406;&#x8BE5;&#x4E8B;&#x4EF6;&#x3002;&#x8BE5;&#x6D41;&#x7A0B;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002;</li>
</ul>
<p><img src="https://img1.zlogs.net/20/20200507154154.png" alt=""></p>
<ul>
<li>&#x8FD9;&#x79CD;&#x59D4;&#x6D3E;&#x5F0F;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x5F88;&#x7C7B;&#x4F3C;&#x4E8E;&#x4EBA;&#x7C7B;&#x793E;&#x4F1A;&#x7684;&#x5206;&#x5DE5;&#x5408;&#x4F5C;&#x3002;&#x4E3E;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#xFF0C;&#x5F53;&#x4EBA;&#x4EEC;&#x60F3;&#x90AE;&#x5BC4;&#x4E00;&#x4EFD;&#x5FEB;&#x9012;&#xFF08;&#x4E8B;&#x4EF6;&#x6E90;&#xFF09;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x5C06;&#x8BE5;&#x5FEB;&#x9012;&#x4EA4;&#x7ED9;&#x5FEB;&#x9012;&#x70B9;&#xFF08;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#xFF09;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x518D;&#x7531;&#x5FEB;&#x9012;&#x70B9;&#x901A;&#x77E5;&#x7269;&#x6D41;&#x516C;&#x53F8;&#xFF08;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#xFF09;&#x8FD0;&#x9001;&#x5FEB;&#x9012;&#xFF0C;&#x800C;&#x5FEB;&#x9012;&#x70B9;&#x4E5F;&#x4F1A;&#x76D1;&#x542C;&#x591A;&#x4E2A;&#x7269;&#x6D41;&#x516C;&#x53F8;&#x7684;&#x5FEB;&#x9012;&#xFF0C;&#x8FDB;&#x800C;&#x901A;&#x77E5;&#x4E0D;&#x540C;&#x7684;&#x7269;&#x6D41;&#x516C;&#x53F8;&#x3002;&#x8FD9;&#x79CD;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x5C06;&#x4E8B;&#x4EF6;&#x6E90;&#x4E0E;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x5206;&#x79BB;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x4F9B;&#x66F4;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x6A21;&#x578B;&#xFF0C;&#x6709;&#x5229;&#x4E8E;&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;</li>
<li><p>&#x57FA;&#x4E8E;&#x4E0A;&#x9762;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x603B;&#x7ED3;&#x51FA;&#x57FA;&#x4E8E;&#x76D1;&#x542C;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x6A21;&#x578B;&#x7684;&#x7F16;&#x7A0B;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ul>
<li>&#xFF08;1&#xFF09;&#x83B7;&#x53D6;&#x8981;&#x88AB;&#x76D1;&#x542C;&#x7684;&#x7EC4;&#x4EF6;&#xFF08;&#x4E8B;&#x4EF6;&#x6E90;&#xFF09;&#x3002;</li>
<li>&#xFF08;2&#xFF09;&#x5B9E;&#x73B0;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x7C7B;&#xFF0C;&#x8BE5;&#x7C7B;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;Java&#x7C7B;&#xFF0C;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;XxxListener&#x63A5;&#x53E3;&#x3002;</li>
<li>&#xFF08;3&#xFF09;&#x8C03;&#x7528;&#x4E8B;&#x4EF6;&#x6E90;&#x7684;setXxxListener&#x65B9;&#x6CD5;&#x5C06;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x5BF9;&#x8C61;&#x6CE8;&#x518C;&#x7ED9;&#x4E8B;&#x4EF6;&#x6E90;&#x3002;</li>
</ul>
</li>
<li><p>&#x5F53;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#x5E94;&#x7528;&#x754C;&#x9762;&#xFF0C;&#x89E6;&#x53D1;&#x4E8B;&#x4EF6;&#x6E90;&#x4E0A;&#x6307;&#x5B9A;&#x7684;&#x4E8B;&#x4EF6;&#x65F6;&#xFF0C;Android&#x4F1A;&#x89E6;&#x53D1;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x7531;&#x8BE5;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x8C03;&#x7528;&#x6307;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#xFF09;&#x6765;&#x5904;&#x7406;&#x4E8B;&#x4EF6;&#x3002;
&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0A;&#x8FF0;&#x4E09;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x6700;&#x5173;&#x952E;&#x7684;&#x6B65;&#x9AA4;&#x662F;&#x5B9E;&#x73B0;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x7C7B;&#x3002;&#x5B9E;&#x73B0;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5B9E;&#x73B0;&#x4E86;&#x7279;&#x5B9A;&#x63A5;&#x53E3;&#x7684;Java&#x7C7B;&#x5B9E;&#x4F8B;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x5B9E;&#x73B0;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#xFF0C;&#x901A;&#x5E38;&#x6709;&#x5982;&#x4E0B;&#x51E0;&#x79CD;&#x5F62;&#x5F0F;&#x3002;</p>
<ul>
<li>&#x5185;&#x90E8;&#x7C7B;&#x5F62;&#x5F0F;&#xFF1A;&#x5C06;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x7C7B;&#x5B9A;&#x4E49;&#x6210;&#x5F53;&#x524D;&#x7C7B;&#x7684;&#x5185;&#x90E8;&#x7C7B;&#x3002;</li>
<li>&#x5916;&#x90E8;&#x7C7B;&#x5F62;&#x5F0F;&#xFF1A;&#x5C06;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x7C7B;&#x5B9A;&#x4E49;&#x6210;&#x4E00;&#x4E2A;&#x5916;&#x90E8;&#x7C7B;&#x3002;<ul>
<li>Activity&#x672C;&#x8EAB;&#x4F5C;&#x4E3A;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x7C7B;&#xFF1A;&#x8BA9;Activity&#x672C;&#x8EAB;&#x5B9E;&#x73B0;&#x76D1;&#x542C;&#x5668;&#x63A5;&#x53E3;&#xFF0C;&#x5E76;&#x5B9E;&#x73B0;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x3002;</li>
</ul>
</li>
<li>&#x533F;&#x540D;&#x5185;&#x90E8;&#x7C7B;&#x5F62;&#x5F0F;&#xFF1A;&#x4F7F;&#x7528;&#x533F;&#x540D;&#x5185;&#x90E8;&#x7C7B;&#x521B;&#x5EFA;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x5BF9;&#x8C61;&#x3002;  </li>
</ul>
</li>
</ul>
<h3 id="&#x521B;&#x5EFA;&#x76D1;&#x542C;&#x5668;&#x7684;&#x51E0;&#x79CD;&#x5F62;&#x5F0F;&#x4E3E;&#x4F8B;">&#x521B;&#x5EFA;&#x76D1;&#x542C;&#x5668;&#x7684;&#x51E0;&#x79CD;&#x5F62;&#x5F0F;&#x4E3E;&#x4F8B;</h3>
<ul>
<li>&#x5916;&#x90E8;&#x7C7B;&#x5F62;&#x5F0F;&#x521B;&#x5EFA;&#x76D1;&#x542C;&#x5668;&#x3002;</li>
</ul>
<p><img src="https://img1.zlogs.net/20/20200507154443.png" alt=""></p>
<ul>
<li>&#x4E0A;&#x9762;&#x7684;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x7C7B;&#x5B9E;&#x73B0;&#x4E86;View.OnClickListener&#x63A5;&#x53E3;&#xFF0C;&#x521B;&#x5EFA;&#x8BE5;&#x76D1;&#x542C;&#x5668;&#x65F6;&#x9700;&#x8981;&#x7A7F;&#x5165;&#x4E00;&#x4E2A;Activity&#x548C;&#x4E00;&#x4E2A;TextView&#xFF0C;&#x6765;&#x770B;&#x5177;&#x4F53;Java&#x4EE3;&#x7801;&#xFF1A;</li>
</ul>
<p><img src="https://img1.zlogs.net/20/20200507154654.png" alt=""></p>
<ul>
<li><p>&#x4E0A;&#x9762;&#x7A0B;&#x5E8F;&#x7B2C;10&#x884C;&#xFF0C;&#x7528;&#x4E8E;&#x7ED9;&#x6309;&#x94AE;&#x7684;&#x5355;&#x51FB;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x76D1;&#x542C;&#x5668;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x5355;&#x51FB;&#x6309;&#x94AE;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x89E6;&#x53D1;&#x76D1;&#x542C;&#x5668;BtnClickListener&#xFF0C;&#x4ECE;&#x800C;&#x6267;&#x884C;&#x76D1;&#x542C;&#x5668;&#x91CC;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
</li>
<li><p>&#x5916;&#x90E8;&#x7C7B;&#x5F62;&#x5F0F;&#x7684;&#x76D1;&#x542C;&#x5668;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5B9E;&#x73B0;&#xFF0C;&#x4E13;&#x95E8;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5916;&#x90E8;&#x7C7B;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x7C7B;&#x63A5;&#x53E3;&#x4F5C;&#x4E3A;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#xFF0C;&#x4E4B;&#x540E;&#x5728;&#x5BF9;&#x5E94;&#x7684;&#x7EC4;&#x4EF6;&#x4E2D;&#x6CE8;&#x518C;&#x8BE5;&#x76D1;&#x542C;&#x5668;&#x3002;</p>
</li>
<li>Activity&#x672C;&#x8EAB;&#x4F5C;&#x4E3A;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x7C7B;&#x3002;</li>
</ul>
<p><img src="https://img1.zlogs.net/20/20200507154804.png" alt=""></p>
<ul>
<li><p>&#x4E0A;&#x9762;&#x7A0B;&#x5E8F;&#x4E2D;Activity&#x76F4;&#x63A5;&#x5B9E;&#x73B0;&#x4E86;View.OnClickListener&#x63A5;&#x53E3;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x8BE5;Activity&#x4E2D;&#x5B9A;onClick(View v)&#x3002;&#x5F53;&#x4E3A;&#x67D0;&#x4E2A;&#x7EC4;&#x4EF6;&#x6DFB;&#x52A0;&#x8BE5;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x76F4;&#x63A5;&#x4F7F;&#x7528;this&#x5173;&#x952E;&#x5B57;&#x4F5C;&#x4E3A;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x5373;&#x53EF;&#x3002;</p>
</li>
<li><p>&#x533F;&#x540D;&#x5185;&#x90E8;&#x7C7B;&#x4F5C;&#x4E3A;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x3002;</p>
</li>
</ul>
<p><img src="https://img1.zlogs.net/20/20200507154944.png" alt=""></p>
<ul>
<li>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x533F;&#x540D;&#x5185;&#x90E8;&#x7C7B;&#x7684;&#x8BED;&#x6CD5;&#x7ED3;&#x6784;&#x6BD4;&#x8F83;&#x5947;&#x602A;&#xFF0C;&#x9664;&#x4E86;&#x8FD9;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x533F;&#x540D;&#x5185;&#x90E8;&#x7C7B;&#x76F8;&#x6BD4;&#x4E8E;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#x6BD4;&#x8F83;&#x6709;&#x4F18;&#x52BF;&#xFF0C;&#x4E00;&#x822C;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x533F;&#x540D;&#x5185;&#x90E8;&#x7C7B;&#x7684;&#x65B9;&#x5F0F;&#x521B;&#x5EFA;&#x76D1;&#x542C;&#x5668;&#x7C7B;&#x3002;</li>
</ul>
<h3 id="&#x5728;&#x6807;&#x7B7E;&#x4E2D;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;">&#x5728;&#x6807;&#x7B7E;&#x4E2D;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;</h3>
<ul>
<li>&#x4E0A;&#x9762;&#x7684;&#x5E03;&#x5C40;&#x6587;&#x4EF6;&#x4E2D;&#x7B2C;20&#x884C;&#xFF0C;Button&#x8BBE;&#x7F6E;&#x4E86;onClick&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x5DF2;&#x7ECF;&#x4E3A;Button&#x7ED1;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#xFF1A;btnClick&#xFF0C;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x5F00;&#x53D1;&#x8005;&#x9700;&#x8981;&#x5728;&#x5BF9;&#x5E94;&#x7684;Activity&#x4E2D;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;void btnClick(View v)&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x5C06;&#x4F1A;&#x5904;&#x7406;Button&#x4E0A;&#x7684;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#xFF0C;&#x6765;&#x770B;Activity&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x3002;</li>
</ul>
<p><img src="https://img1.zlogs.net/20/20200507155117.png" alt=""></p>
<ul>
<li>&#x4E0A;&#x9762;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x7B2C;11&#x884C;&#x5C31;&#x662F;&#x5C5E;&#x6027;onClick&#x5BF9;&#x5E94;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x8BE5;&#x6309;&#x94AE;&#x65F6;&#xFF0C;btnClick&#x65B9;&#x6CD5;&#x5C06;&#x4F1A;&#x88AB;&#x89E6;&#x53D1;&#x8FDB;&#x800C;&#x5904;&#x7406;&#x6B64;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x3002;</li>
</ul>
<h2 id="&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;">&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;</h2>
<h3 id="&#x56DE;&#x8C03;&#x673A;&#x5236;">&#x56DE;&#x8C03;&#x673A;&#x5236;</h3>
<ul>
<li>&#x524D;&#x9762;&#x63D0;&#x5230;&#x76D1;&#x542C;&#x673A;&#x5236;&#x662F;&#x4E00;&#x79CD;&#x59D4;&#x6D3E;&#x5F0F;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x673A;&#x5236;&#xFF0C;&#x4E8B;&#x4EF6;&#x6E90;&#x4E0E;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x5206;&#x79BB;&#xFF0C;&#x7528;&#x6237;&#x89E6;&#x53D1;&#x4E8B;&#x4EF6;&#x6E90;&#x6307;&#x5B9A;&#x7684;&#x4E8B;&#x4EF6;&#x4E4B;&#x540E;&#xFF0C;&#x4EA4;&#x7ED9;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x5904;&#x7406;&#x76F8;&#x5E94;&#x7684;&#x4E8B;&#x4EF6;&#x3002;&#x800C;&#x56DE;&#x8C03;&#x673A;&#x5236;&#x5219;&#x5B8C;&#x5168;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x7684;&#x4E8B;&#x4EF6;&#x6E90;&#x4E0E;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x662F;&#x7EDF;&#x4E00;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x5B83;&#x6CA1;&#x6709;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x56DE;&#x8C03;&#x81EA;&#x8EAB;&#x7279;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x5904;&#x7406;&#x76F8;&#x5E94;&#x7684;&#x4E8B;&#x4EF6;&#x3002;</li>
<li>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x56DE;&#x8C03;&#x673A;&#x5236;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#xFF0C;&#x9700;&#x8981;&#x7EE7;&#x627F;GUI&#x7EC4;&#x4EF6;&#x7C7B;&#xFF0C;&#x5E76;&#x91CD;&#x5199;&#x5BF9;&#x5E94;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x7B2C;2&#x7AE0;&#x4E2D;&#x8BB2;&#x5230;&#x7684;&#x81EA;&#x5B9A;&#x4E49;UI&#x7EC4;&#x4EF6;&#x7684;&#x65B9;&#x6CD5;&#x3002;Android&#x4E3A;&#x6240;&#x6709;&#x7684;GUI&#x7EC4;&#x4EF6;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x7684;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;View&#x7C7B;&#x4E3A;&#x4F8B;&#xFF0C;&#x8BE5;&#x7C7B;&#x5305;&#x542B;&#x5982;&#x4E0B;&#x8868;&#x6240;&#x793A;&#x65B9;&#x6CD5;&#x3002;</li>
</ul>
<p><img src="https://img1.zlogs.net/20/20200507155258.png" alt=""></p>
<ul>
<li>&#x5C31;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x7684;&#x89D2;&#x5EA6;&#x800C;&#x8A00;&#xFF0C;&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x6A21;&#x578B;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;</li>
</ul>
<h3 id="&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x4F20;&#x64AD;">&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x4F20;&#x64AD;</h3>
<ul>
<li>&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x63A7;&#x5236;&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x4F20;&#x64AD;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x90FD;&#x6709;&#x4E00;&#x4E2A;boolean&#x7C7B;&#x578B;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x8BE5;&#x8FD4;&#x56DE;&#x503C;&#x51B3;&#x5B9A;&#x4E86;&#x5BF9;&#x5E94;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x80FD;&#x5426;&#x5B8C;&#x5168;&#x5904;&#x7406;&#x8BE5;&#x4E8B;&#x4EF6;&#x3002;&#x5F53;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;false&#x65F6;&#xFF0C;&#x8868;&#x660E;&#x8BE5;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x5E76;&#x672A;&#x5B8C;&#x5168;&#x5904;&#x7406;&#x8BE5;&#x4E8B;&#x4EF6;&#xFF0C;&#x4E8B;&#x4EF6;&#x4F1A;&#x7EE7;&#x7EED;&#x5411;&#x4E0B;&#x4F20;&#x64AD;&#xFF1B;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;true&#x65F6;&#xFF0C;&#x8868;&#x660E;&#x8BE5;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x5DF2;&#x5B8C;&#x5168;&#x5904;&#x7406;&#x8BE5;&#x4E8B;&#x4EF6;&#xFF0C;&#x8BE5;&#x4E8B;&#x4EF6;&#x4E0D;&#x4F1A;&#x7EE7;&#x7EED;&#x4F20;&#x64AD;&#x3002;&#x56E0;&#x6B64;&#x5BF9;&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x800C;&#x8A00;&#xFF0C;&#x67D0;&#x7EC4;&#x4EF6;&#x4E0A;&#x6240;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#x4E0D;&#x4EC5;&#x4F1A;&#x6FC0;&#x53D1;&#x8BE5;&#x7EC4;&#x4EF6;&#x4E0A;&#x7684;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x4F1A;&#x89E6;&#x53D1;&#x6240;&#x5728;Activity&#x7684;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#xFF0C;&#x53EA;&#x8981;&#x8BE5;&#x4E8B;&#x4EF6;&#x80FD;&#x4F20;&#x64AD;&#x5230;&#x8BE5;Activity&#x3002;</li>
</ul>
<h3 id="&#x4E0E;&#x76D1;&#x542C;&#x673A;&#x5236;&#x5BF9;&#x6BD4;">&#x4E0E;&#x76D1;&#x542C;&#x673A;&#x5236;&#x5BF9;&#x6BD4;</h3>
<ul>
<li><p>&#x5BF9;&#x6BD4;&#x8FD9;&#x4E24;&#x79CD;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x6A21;&#x578B;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x57FA;&#x4E8E;&#x76D1;&#x542C;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x6A21;&#x578B;&#x6BD4;&#x8F83;&#x6709;&#x4F18;&#x52BF;&#xFF1A;</p>
<ul>
<li>&#x5206;&#x5DE5;&#x660E;&#x786E;&#xFF0C;&#x4E8B;&#x4EF6;&#x6E90;&#x4E0E;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x5206;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x8F83;&#x597D;&#x3002;</li>
<li>&#x4F18;&#x5148;&#x88AB;&#x89E6;&#x53D1;&#x3002;</li>
</ul>
</li>
<li><p>&#x4F46;&#x5728;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x673A;&#x5236;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x805A;&#x6027;&#x3002;</p>
</li>
</ul>
<ul>
<li><blockquote>
<p>&#x4F8B;&#x5982;&#x4F8B;2-1&#x4E2D;&#xFF0C; &#x5C31;&#x91C7;&#x7528;&#x4E86;&#x56DE;&#x8C03;&#x7684;&#x65B9;&#x5F0F;&#x81EA;&#x5B9A;&#x4E49;&#x4E86;BallView&#x7C7B;&#x3002;&#x901A;&#x8FC7;&#x4E3A;View&#x63D0;&#x4F9B;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x7684;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x628A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x5C01;&#x88C5;&#x5728;&#x8BE5;View&#x5185;&#x90E8;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x805A;&#x6027;&#x3002;
&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x66F4;&#x9002;&#x5408;&#x89E3;&#x51B3;&#x5982;&#x4F8B;2-1&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x903B;&#x8F91;&#x6BD4;&#x8F83;&#x56FA;&#x5B9A;&#x7684;View&#x3002;</p>
</blockquote>
</li>
</ul>
<h2 id="&#x54CD;&#x5E94;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x7684;&#x4E8B;&#x4EF6;">&#x54CD;&#x5E94;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x7684;&#x4E8B;&#x4EF6;</h2>
<blockquote>
<p>&#x5728;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x9047;&#x5230;&#x6A2A;&#x7AD6;&#x5C4F;&#x5207;&#x6362;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5728;Android&#x5E94;&#x7528;&#x4E2D;&#x6A2A;&#x7AD6;&#x5C4F;&#x5207;&#x6362;&#x5E76;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8BBE;&#x5907;&#x5C4F;&#x5E55;&#x7684;&#x6A2A;&#x7AD6;&#x5C4F;&#x5207;&#x6362;&#xFF0C;&#x5B83;&#x8FD8;&#x6D89;&#x53CA;Activity&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x9500;&#x6BC1;&#x4E0E;&#x91CD;&#x5EFA;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x9047;&#x5230;&#x7C7B;&#x4F3C;&#x6A2A;&#x7AD6;&#x5C4F;&#x5207;&#x6362;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C31;&#x9700;&#x8981;&#x6839;&#x636E;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x7F6E;&#x505A;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x672C;&#x8282;&#x8981;&#x8BB2;&#x8FF0;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
</blockquote>
<h3 id="configuration&#x7C7B;&#x7B80;&#x4ECB;">Configuration&#x7C7B;&#x7B80;&#x4ECB;</h3>
<ul>
<li>Configuration&#x7C7B;&#x4E13;&#x95E8;&#x7528;&#x6765;&#x63CF;&#x8FF0;Android&#x624B;&#x673A;&#x7684;&#x8BBE;&#x5907;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x65E2;&#x5305;&#x62EC;&#x7528;&#x6237;&#x7279;&#x5B9A;&#x7684;&#x914D;&#x7F6E;&#x9879;&#xFF0C;&#x4E5F;&#x5305;&#x62EC;&#x7CFB;&#x7EDF;&#x7684;&#x52A8;&#x6001;&#x8BBE;&#x5907;&#x914D;&#x7F6E;&#x3002;</li>
<li>&#x83B7;&#x53D6;Configuration&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#xFF1A;</li>
</ul>
<pre><code class="lang-java">Configuration cfg = getResources().getCongigration();
</code></pre>
<ul>
<li>&#x83B7;&#x53D6;&#x4E86;&#x8BE5;&#x5BF9;&#x8C61;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BE5;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x7684;&#x5982;&#x8868;&#x6240;&#x793A;&#x7684;&#x5C5E;&#x6027;&#x6765;&#x83B7;&#x53D6;&#x7CFB;&#x7EDF;&#x7684;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x3002;</li>
</ul>
<p><img src="https://img1.zlogs.net/20/20200507155823.png" alt=""></p>
<h3 id="onconfigurationchanged&#x65B9;&#x6CD5;">onConfigurationChanged&#x65B9;&#x6CD5;</h3>
<ul>
<li>&#x5728;Android&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x770B;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E3A;&#x9002;&#x5E94;&#x624B;&#x673A;&#x5C4F;&#x5E55;&#x7684;&#x6A2A;&#x7AD6;&#x5C4F;&#x5207;&#x6362;&#xFF0C;&#x4E5F;&#x5207;&#x6362;&#x4E86;&#x6A2A;&#x7AD6;&#x5C4F;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x3002;&#x5B9E;&#x73B0;&#x6B64;&#x529F;&#x80FD;&#x9700;&#x8981;&#x5BF9;&#x5C4F;&#x5E55;&#x7684;&#x6A2A;&#x7AD6;&#x5C4F;&#x53D8;&#x5316;&#x8FDB;&#x884C;&#x76D1;&#x542C;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x91CD;&#x5199;Activity&#x7684;onConfigurationChanged(Configuration newConfig)&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x76D1;&#x542C;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#xFF1A;&#x5F53;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x89E6;&#x53D1;&#x3002;</li>
</ul>
<h2 id="handler&#x6D88;&#x606F;&#x4F20;&#x9012;&#x673A;&#x5236;">Handler&#x6D88;&#x606F;&#x4F20;&#x9012;&#x673A;&#x5236;</h2>
<ul>
<li>&#x5F00;&#x53D1;&#x4E00;&#x6B3E;APP&#x80AF;&#x5B9A;&#x90FD;&#x4F1A;&#x6D89;&#x53CA;&#x5230;&#x66F4;&#x65B0;UI&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;Android&#x4E2D;&#x89C4;&#x5B9A;&#xFF1A;&#x53EA;&#x5141;&#x8BB8;UI&#x7EBF;&#x7A0B;&#x4FEE;&#x6539;Activity&#x4E2D;&#x7684;UI&#x7EC4;&#x4EF6;&#x3002;</li>
<li>UI&#x7EBF;&#x7A0B;&#x5C31;&#x662F;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF0C;&#x662F;&#x968F;&#x7740;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x800C;&#x81EA;&#x52A8;&#x542F;&#x52A8;&#x7684;&#x4E00;&#x6761;&#x7EBF;&#x7A0B;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x5904;&#x7406;&#x4E0E;UI&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x7528;&#x6237;&#x7684;&#x5355;&#x51FB;&#x64CD;&#x4F5C;&#x3001;&#x89E6;&#x6478;&#x5C4F;&#x64CD;&#x4F5C;&#x4EE5;&#x53CA;&#x5C4F;&#x5E55;&#x7ED8;&#x56FE;&#x7B49;&#xFF0C;&#x5E76;&#x628A;&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x4EF6;&#x5206;&#x53D1;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x7EC4;&#x4EF6;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</li>
<li>&#x65E2;&#x7136;Android&#x5B98;&#x65B9;&#x89C4;&#x5B9A;&#x53EA;&#x80FD;&#x5728;UI&#x7EBF;&#x7A0B;&#x4E2D;&#x66F4;&#x65B0;UI&#x7EC4;&#x4EF6;&#xFF0C;&#x90A3;&#x662F;&#x4E0D;&#x662F;&#x65B0;&#x542F;&#x52A8;&#x7684;&#x7EBF;&#x7A0B;&#x5C31;&#x65E0;&#x6CD5;&#x52A8;&#x6001;&#x6539;&#x53D8;UI&#x7EC4;&#x4EF6;&#x7684;&#x5C5E;&#x6027;&#x503C;&#x4E86;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x5F53;&#x7136;&#x662F;&#x5426;&#x5B9A;&#x7684;&#x3002;&#x672C;&#x8282;&#x4E2D;&#x7684;Handler&#x6D88;&#x606F;&#x4F20;&#x9012;&#x673A;&#x5236;&#x5C31;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</li>
</ul>
<h3 id="handler&#x7C7B;&#x7B80;&#x4ECB;">Handler&#x7C7B;&#x7B80;&#x4ECB;</h3>
<ul>
<li>Handler&#x7C7B;&#x53EF;&#x4EE5;&#x5728;&#x65B0;&#x542F;&#x52A8;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x5411;&#x4E3B;&#x7EBF;&#x7A0B;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x83B7;&#x53D6;&#x5230;&#x6D88;&#x606F;&#x5E76;&#x5904;&#x7406;&#x76F8;&#x5E94;&#x64CD;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x66F4;&#x65B0;UI&#x7684;&#x6548;&#x679C;&#x3002;</li>
<li>Handler&#x91C7;&#x7528;&#x56DE;&#x8C03;&#x7684;&#x65B9;&#x5F0F;&#x5904;&#x7406;&#x65B0;&#x7EBF;&#x7A0B;&#x53D1;&#x9001;&#x6765;&#x7684;&#x6D88;&#x606F;&#x3002;&#x5F53;&#x65B0;&#x542F;&#x52A8;&#x7684;&#x7EBF;&#x7A0B;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x540E;&#xFF0C;&#x6D88;&#x606F;&#x88AB;&#x53D1;&#x9001;&#x5230;&#x4E0E;&#x4E4B;&#x76F8;&#x5173;&#x8054;&#x7684;MessageQueue&#x4E2D;&#xFF0C;&#x6700;&#x540E;Handler&#x4E0D;&#x65AD;&#x4ECE;MessageQueue&#x4E2D;&#x83B7;&#x53D6;&#x5E76;&#x5904;&#x7406;&#x6D88;&#x606F;&#x3002;Handler&#x7C7B;&#x5305;&#x542B;&#x5982;&#x4E0B;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x53D1;&#x9001;&#x3001;&#x5904;&#x7406;&#x6D88;&#x606F;&#xFF0C;&#x5982;&#x8868;&#x6240;&#x793A;&#x3002;</li>
</ul>
<p><img src="https://img1.zlogs.net/20/20200507160102.png" alt=""></p>
<ul>
<li>&#x501F;&#x52A9;&#x4E8E;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5229;&#x7528;Handler&#x5B9E;&#x73B0;&#x6D88;&#x606F;&#x7684;&#x4F20;&#x9012;&#x3002;</li>
<li>Handler&#x901A;&#x8FC7;&#x91CD;&#x5199;handleMessage(Message msg)&#x65B9;&#x6CD5;&#x6765;&#x63A5;&#x6536;&#x65B0;&#x7EBF;&#x7A0B;&#x53D1;&#x9001;&#x6765;&#x7684;&#x6D88;&#x606F;&#xFF08;&#x88AB;&#x81EA;&#x52A8;&#x56DE;&#x8C03;&#xFF09;&#xFF0C;&#x800C;handleMessage(Message msg)&#x65B9;&#x6CD5;&#x5B58;&#x5728;&#x4E8E;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x52A8;&#x6001;&#x4FEE;&#x6539;ImageView&#x5C5E;&#x6027;&#x503C;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#x7531;&#x65B0;&#x7EBF;&#x7A0B;&#x4FEE;&#x6539;UI&#x7EC4;&#x4EF6;&#x7684;&#x6548;&#x679C;&#x3002;</li>
</ul>
<h3 id="handler&#x3001;loop&#x53CA;messagequeue&#x4E09;&#x8005;&#x7684;&#x5173;&#x7CFB;">Handler&#x3001;Loop&#x53CA;MessageQueue&#x4E09;&#x8005;&#x7684;&#x5173;&#x7CFB;</h3>
<ul>
<li>&#x524D;&#x9762;&#x63D0;&#x5230;&#x65B0;&#x7EBF;&#x7A0B;&#x5C06;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x81F3;MessageQueue&#xFF0C;&#x7136;&#x540E;Handler&#x4E0D;&#x65AD;&#x4ECE;MessageQueue&#x4E2D;&#x83B7;&#x53D6;&#x5E76;&#x5904;&#x7406;&#x6D88;&#x606F;&#x3002;Handler&#x4ECE;MessageQueue&#x4E2D;&#x8BFB;&#x53D6;&#x6D88;&#x606F;&#x5C31;&#x8981;&#x7528;&#x5230;Looper&#xFF0C;Looper&#x7684;loop&#x65B9;&#x6CD5;&#x8D1F;&#x8D23;&#x8BFB;&#x53D6;MessageQueue&#x4E2D;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x8BFB;&#x53D6;&#x6D88;&#x606F;&#x4E4B;&#x540E;&#x628A;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x7ED9;Handler&#x6765;&#x5904;&#x7406;&#x3002;</li>
</ul>
<p><img src="https://img1.zlogs.net/20/20200507160416.png" alt=""></p>
<ul>
<li>&#x4E0A;&#x56FE;&#x5F88;&#x597D;&#x5730;&#x5C55;&#x793A;&#x4E86;&#x8FD9;&#x4E09;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5982;&#x679C;&#x5E0C;&#x671B;Handler&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x5FC5;&#x987B;&#x5728;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;Looper&#x5BF9;&#x8C61;&#x3002;&#x800C;Looper&#x7684;&#x521B;&#x5EFA;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;<ul>
<li>&#xFF08;1&#xFF09;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x5373;UI&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x7CFB;&#x7EDF;&#x5DF2;&#x9ED8;&#x8BA4;&#x521D;&#x59CB;&#x5316;&#x4E86;&#x4E00;&#x4E2A;Looper&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x6B64;&#x7A0B;&#x5E8F;&#x53EF;&#x76F4;&#x63A5;&#x521B;&#x5EFA;Handler&#x5373;&#x53EF;&#x3002;</li>
<li>&#xFF08;2&#xFF09;&#x5F00;&#x53D1;&#x8005;&#x65B0;&#x5EFA;&#x7684;&#x5B50;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x5FC5;&#x987B;&#x81EA;&#x5DF1;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;Looper&#x5BF9;&#x8C61;&#x5E76;&#x542F;&#x52A8;&#x5B83;&#xFF0C;&#x624D;&#x53EF;&#x4F7F;&#x7528;Handler&#x3002;&#x521B;&#x5EFA;Looper&#x5BF9;&#x8C61;&#x8C03;&#x7528;&#x5B83;&#x7684;prepare()&#x65B9;&#x6CD5;&#x5373;&#x53EF;&#x3002;</li>
</ul>
</li>
<li>&#x4E0B;&#x9762;&#x6765;&#x5206;&#x522B;&#x5F52;&#x7EB3;&#x4E00;&#x4E0B;&#x8FD9;&#x4E09;&#x8005;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5982;&#x8868;&#x6240;&#x793A;&#x3002;</li>
</ul>
<p><img src="https://img1.zlogs.net/20/20200507160521.png" alt=""></p>
<ul>
<li>&#x5728;&#x65B0;&#x5EFA;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;Handler&#x7684;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#xFF1A;<ul>
<li>&#xFF08;1&#xFF09;&#x8C03;&#x7528;Looper&#x7684;prepare()&#x65B9;&#x6CD5;&#x4E3A;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x521B;&#x5EFA;Looper&#x5BF9;&#x8C61;&#xFF0C;&#x521B;&#x5EFA;Looper&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;Looper&#x7684;&#x6784;&#x9020;&#x65B9;&#x6CD5;&#x4F1A;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x4E0E;&#x4E4B;&#x5339;&#x914D;&#x7684;MessageQueue&#x3002;</li>
<li>&#xFF08;2&#xFF09;Looper&#x521B;&#x5EFA;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x5F00;&#x59CB;&#x521B;&#x5EFA;Handler&#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x91CD;&#x5199;handleMessage()&#x65B9;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x8D1F;&#x8D23;&#x5904;&#x7406;&#x6765;&#x81EA;&#x4E8E;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x7684;&#x6D88;&#x606F;&#x3002;</li>
<li>&#xFF08;3&#xFF09;&#x8C03;&#x7528;Looper&#x7684;loop()&#x65B9;&#x6CD5;&#x542F;&#x52A8;Looper&#x3002;</li>
</ul>
</li>
</ul>
<div id="gitalk-container"></div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1011.html" class="navigation navigation-prev " aria-label="Previous page: *Intent和IntentFilter">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1014.html" class="navigation navigation-next " aria-label="Next page: 资源处理">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"事件处理","level":"1.5","depth":1,"next":{"title":"资源处理","level":"1.6","depth":1,"path":"page/1014.md","ref":"page/1014.md","articles":[{"title":"应用资源","level":"1.6.1","depth":2,"path":"page/1015.md","ref":"page/1015.md","articles":[]},{"title":"图形图像","level":"1.6.2","depth":2,"path":"page/1013.md","ref":"page/1013.md","articles":[]},{"title":"文件","level":"1.6.3","depth":2,"path":"page/1016.md","ref":"page/1016.md","articles":[]},{"title":"数据库","level":"1.6.4","depth":2,"path":"page/1017.md","ref":"page/1017.md","articles":[]},{"title":"其他","level":"1.6.5","depth":2,"path":"page/1020.md","ref":"page/1020.md","articles":[]}]},"previous":{"title":"*Intent和IntentFilter","level":"1.4.5","depth":2,"path":"page/1011.md","ref":"page/1011.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","-sharing","theme-simple@git+https://github.com/plugins-zander/gitbook-plugin-theme-simple.git","search-pro@git+https://github.com/plugins-zander/gitbook-plugin-search-pro.git","katex@git+https://github.com/plugins-zander/gitbook-plugin-katex.git","splitter@git+https://github.com/plugins-zander/gitbook-plugin-splitter.git","mygitalk@git+https://github.com/plugins-zander/gitbook-plugin-mygitalk.git","edit-link@git+https://github.com/plugins-zander/gitbook-plugin-edit-link.git","sitemap-general@git+https://github.com/plugins-zander/gitbook-plugin-sitemap-general.git","gtag@git+https://github.com/plugins-zander/gitbook-plugin-gtag.git","chapter-fold@git+https://github.com/plugins-zander/gitbook-plugin-chapter-fold.git","copy-code-button@git+https://github.com/plugins-zander/gitbook-plugin-copy-code-button.git","page-toc@git+https://github.com/plugins-zander/gitbook-plugin-page-toc.git"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"chapter-fold":{},"splitter":{},"search-pro":{},"page-toc":{"position":"before-first","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4","showByDefault":true},"sitemap-general":{"prefix":"https://zlogs.net/learn-android/"},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"gtag":{"token":"UA-149127400-1"},"highlight":{},"theme-simple":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"copy-code-button":{},"mygitalk":{"flipMoveOptions":{},"clientID":"364365ceb2659b383d73","number":-1,"perPage":10,"proxy":"https://cors-anywhere.herokuapp.com/https://github.com/login/oauth/access_token","admin":["zanderzhao"],"createIssueManually":false,"distractionFreeMode":false,"repo":"talk","owner":"zanderzhao","enableHotKey":true,"clientSecret":"447ef6648e9dfffe2e2a65c34c8ead1dd4b7af54","pagerDirection":"last","labels":["Gitalk"]},"edit-link":{"label":"EDIT","base":"https://github.com/ZanderZhao/learn-android/edit/master/"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Zander Zhao","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"learn-android","language":"zh-hans","gitbook":"3.2.3","description":"learn-android - Zander's Learn Book"},"file":{"path":"page/1012.md","mtime":"2020-06-13T17:43:32.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-06-13T17:49:20.330Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/ZanderZhao/cdn/js/md5.min.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/ZanderZhao/cdn/js/gitalk.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mygitalk/mygitalk.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-gtag/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc/anchor-3.1.1.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc/page-toc.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

